test/cassettes/renew_subscription_when_previous_subscription_is_expired_and_user_has_primary_saved_payment_method.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox.espago.com/api/charges
    body:
      encoding: UTF-8
      string: '{"amount":"4.99","currency":"PLN","description":"pay_f7bf4d9c-b4c0-4723-87bd-af38c6b8e5c1","positive_url":"http://localhost:3001/payments/pay_f7bf4d9c-b4c0-4723-87bd-af38c6b8e5c1/success","negative_url":"http://localhost:3001/payments/pay_f7bf4d9c-b4c0-4723-87bd-af38c6b8e5c1/rejected","client":"cli_9d05-phkJnJOajc0","cof":"recurring"}'
    headers:
      User-Agent:
      - Faraday v2.13.1
      Accept:
      - application/vnd.espago.v3+json
      Authorization:
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: ''
    headers:
      Date:
      - Thu, 25 Dec 2025 13:04:38 GMT
      Content-Type:
      - application/json; charset=utf-8
      Etag:
      - W/"8e4dc0e92ad3266cf34a64d2d147fc55"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Strict-Transport-Security:
      - max-age=31536000; includeSubdomains; preload
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Content-Security-Policy:
      - default-src 'none'; base-uri 'none'; block-all-mixed-content; child-src 'self'
        sandbox.espago.com sandbox-static.espago.com; connect-src 'self' sandbox.espago.com
        sandbox-static.espago.com; font-src 'self' sandbox.espago.com sandbox-static.espago.com;
        form-action 'self' sandbox.espago.com sandbox-static.espago.com; img-src 'self'
        sandbox.espago.com sandbox-static.espago.com; manifest-src 'none'; media-src
        'none'; object-src 'none'; script-src 'self' sandbox.espago.com sandbox-static.espago.com;
        style-src 'self' sandbox.espago.com sandbox-static.espago.com; upgrade-insecure-requests;
        worker-src 'none'; report-uri https://csp-report.espago.com/csp_app0_sandbox/store
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: '{"id":"pay_9d0A9BgsLr9j0oLv","description":"pay_f7bf4d9c-b4c0-4723-87bd-af38c6b8e5c1","channel":"elavon","amount":"4.99","currency":"PLN","state":"executed","client":"cli_9d05-phkJnJOajc0","created_at":1766667877,"card":{"company":"VI","last4":"0006","year":2028,"month":1,"first_name":"John","last_name":"Doe","authorized":null,"card_identifier":"cid_9cfzW0qxuoyOOi5h","created_at":1765831439},"issuer_response_code":"00","reversable":true,"cof":"recurring","transaction_id":"tr_9d0FfLYzK","tokenization_used":false}'
  recorded_at: Thu, 25 Dec 2025 13:04:38 GMT
recorded_with: VCR 6.3.1
